Autodesk.Revit.DB.TransformWithBoundary.GetBoundary
Returns the boundary for the model-to-projection transform.
Remarks:
Before you transform a model point to projection space using the transform returned by Autodesk.Revit.DB.TransformWithBoundary.GetModelToProjectionTransform,
test to make sure the model point is visible through this 2D boundary.  The model-to-projection transform is only valid for points in 3D model
space that can be seen through the 2D boundary, when looking in the direction of View.ViewDirection.
The boundary is one enclosed region of the view's crop.
For uncropped views 'null' is returned.
For cropped views that do not have split crop regions, the boundary is the shape of the view crop. Typically the boundary is
rectangular, but more complex shapes are supported.
For cropped views that have split crop regions, the boundary is one rectangular region of the split view crop.
Even though the boundary represents the view crop - a 2D polygon drawn on the view's cut plane - any point in 3D model space
that can be seen through the boundary when looking in the direction of the view (see View.ViewDirection) is considered
to be inside the boundary and can be transformed using the model-to-projection transform returned by
Autodesk.Revit.DB.TransformWithBoundary.GetModelToProjectionTransform. For example, if the shape of the CurveLoop is a circle, then there is an infinite
cylinder in 3D model space and any point inside that cylinder can be transformed with the model-to-projection transform.
To test if a point in 3D model space is within the boundary, first project the point and the CurveLoop onto a
plane which is perpendicular to the view direction.  Then use a point-in-polygon algorithm to check if the projected
point is inside the polygon described by the CurveLoop.
It is guaranteed that the boundary CurveLoop lies on a plane which is perpendicular to View.ViewDirection and
that the CurveLoop does not self-intersect and is closed.  It is also guaranteed that the boundaries of different
TransformWithBoundary regions of the same view don't overlap with each other.
Returns:
A closed loop in model space representing the region of model space to which the model-to-projection transform applies.
Since:
2020.1

Autodesk.Revit.DB.TransformWithBoundary.GetModelToProjectionTransform
Gets the model-to-projection transform.
Remarks:
The transform can be used to transform points from model space to view projection space.
Model space is the global 3D coordinate space in which the 3D geometry of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
For uncropped views all model space points can be transformed to projection space using
the this transform.
For cropped views only model points which lie inside the boundary returned by Autodesk.Revit.DB.TransformWithBoundary.GetBoundary
should be transformed to projection space using this transform.
Returns:
The model-to-projection transformation.
Since:
2020.1

Autodesk.Revit.DB.TransformWithBoundary.#ctor(Autodesk.Revit.DB.TransformWithBoundary)
Constructs a new copy of the input TransformWithBoundary object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.TransformWithBoundary
This class contains the transform from model space to projection space for a view and the
boundary in model space in which the transform is valid.
Remarks:
Use the model-to-projection transform returned by Autodesk.Revit.DB.TransformWithBoundary.GetModelToProjectionTransform to transform model points to
the view's projection space.  The model-to-projection transform is only valid for points in 3D model space that that can be seen
through the 2D boundary returned by Autodesk.Revit.DB.TransformWithBoundary.GetBoundary, when looking in the direction of View.ViewDirection.
For views that are placed on sheets, you can combine the View's model-to-projection transform and the Viewport's
projection-to-sheet transform to transform model points to sheet space:
sheetXYZ = projectionToSheetTransform * modelToProjectionTransform * modelXYZ
Model space is the global 3D coordinate space in which the 3D geometry of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
Sheet space is the coordinate space of one sheet.  This is the space in which viewports and
titleblocks are arranged on the sheet.
Since:
2020.1